#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>
```

Success! The configuration is valid.


```
</details>
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
data.template_file.env_vars: Reading...
data.template_file.env_vars: Read complete after 0s [id=e5788e930d023f375c2b0a7687a7504863c707f7748b54b90cf01afa104fdcda]
data.aws_iam_policy_document.assume_role_policy: Reading...
aws_cloudwatch_log_group.log-group: Refreshing state... [id=weather-forecast-prod-logs]
aws_ecs_cluster.aws-ecs-cluster: Refreshing state... [id=arn:aws:ecs:ap-south-1:522814736852:cluster/weather-forecast-prod-cluster]
aws_ecr_repository.aws-ecr: Refreshing state... [id=weather-forecast-prod-ecr]
aws_vpc.aws-vpc: Refreshing state... [id=vpc-0464a31c8a9c91242]
aws_eip.nat: Refreshing state... [id=eipalloc-0bdcec9982745ee80]
data.aws_iam_policy_document.assume_role_policy: Read complete after 0s [id=1077804475]
aws_iam_role.ecsTaskExecutionRole: Refreshing state... [id=weather-forecast-execution-task-role]
aws_iam_role_policy_attachment.ecsTaskExecutionRole_policy: Refreshing state... [id=weather-forecast-execution-task-role-20250531051703584500000001]
aws_ecs_task_definition.aws-ecs-task: Refreshing state... [id=weather-forecast-task]
data.aws_ecs_task_definition.main: Reading...
data.aws_ecs_task_definition.main: Read complete after 0s [id=arn:aws:ecs:ap-south-1:522814736852:task-definition/weather-forecast-task:3]
aws_internet_gateway.aws-igw: Refreshing state... [id=igw-0e7143d527444c3b0]
aws_subnet.private[0]: Refreshing state... [id=subnet-0459d14f3ab7030e7]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-south-1:522814736852:targetgroup/weather-forecast-prod-tg/853fb385610b20ec]
aws_subnet.private[1]: Refreshing state... [id=subnet-07dbe8ac1a1b06021]
aws_subnet.public[1]: Refreshing state... [id=subnet-01e9029b0ee708da6]
aws_subnet.public[0]: Refreshing state... [id=subnet-046fa89400a0391fd]
aws_route_table.public: Refreshing state... [id=rtb-0dd90643a9da2f42d]
aws_security_group.load_balancer_security_group: Refreshing state... [id=sg-08cc87f96210f5875]
aws_route_table.private: Refreshing state... [id=rtb-05d9734fa418f2dba]
aws_nat_gateway.nat: Refreshing state... [id=nat-036b3d375bfb020a1]
aws_security_group.service_security_group: Refreshing state... [id=sg-0dbbbcca1cd4c503c]
aws_alb.application_load_balancer: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-south-1:522814736852:loadbalancer/app/weather-forecast-prod-alb/688e68496c5f6fa1]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-085235413b2bdd8c3]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-08b953714f613dfa8]
aws_route.public: Refreshing state... [id=r-rtb-0dd90643a9da2f42d1080289494]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0178c130dee795039]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-06bb37ea3478c4efb]
aws_route.private: Refreshing state... [id=r-rtb-05d9734fa418f2dba1080289494]
aws_route53_record.alb_dns_record: Refreshing state... [id=Z10071467DLAGMP0KJMM_ravicloudexper.online_A]
aws_lb_listener.listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-south-1:522814736852:listener/app/weather-forecast-prod-alb/688e68496c5f6fa1/abcbc402add8cd32]
aws_ecs_service.aws-ecs-service: Refreshing state... [id=arn:aws:ecs:ap-south-1:522814736852:service/weather-forecast-prod-cluster/weather-forecast-prod-ecs-service]
aws_appautoscaling_target.ecs_target: Refreshing state... [id=service/weather-forecast-prod-cluster/weather-forecast-prod-ecs-service]
aws_appautoscaling_policy.ecs_policy_memory: Refreshing state... [id=weather-forecast-prod-memory-autoscaling]
aws_appautoscaling_policy.ecs_policy_cpu: Refreshing state... [id=weather-forecast-prod-cpu-autoscaling]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_appautoscaling_policy.ecs_policy_cpu will be updated in-place
  ~ resource "aws_appautoscaling_policy" "ecs_policy_cpu" {
        id                 = "weather-forecast-prod-cpu-autoscaling"
        name               = "weather-forecast-prod-cpu-autoscaling"
        # (6 unchanged attributes hidden)

      ~ target_tracking_scaling_policy_configuration {
          ~ target_value       = 80 -> 4173
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # aws_appautoscaling_policy.ecs_policy_memory will be updated in-place
  ~ resource "aws_appautoscaling_policy" "ecs_policy_memory" {
        id                 = "weather-forecast-prod-memory-autoscaling"
        name               = "weather-forecast-prod-memory-autoscaling"
        # (6 unchanged attributes hidden)

      ~ target_tracking_scaling_policy_configuration {
          ~ target_value       = 80 -> 4173
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # aws_ecs_service.aws-ecs-service will be updated in-place
  ~ resource "aws_ecs_service" "aws-ecs-service" {
        id                                 = "arn:aws:ecs:ap-south-1:522814736852:service/weather-forecast-prod-cluster/weather-forecast-prod-ecs-service"
        name                               = "weather-forecast-prod-ecs-service"
        tags                               = {}
      ~ task_definition                    = "weather-forecast-task:2" -> "weather-forecast-task:3"
        # (17 unchanged attributes hidden)

      - load_balancer {
          - container_name   = "weather-forecast-prod-container" -> null
          - container_port   = 80 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:ap-south-1:522814736852:targetgroup/weather-forecast-prod-tg/853fb385610b20ec" -> null
            # (1 unchanged attribute hidden)
        }
      + load_balancer {
          + container_name   = "weather-forecast-prod-container"
          + container_port   = 4173
          + target_group_arn = (known after apply)
            # (1 unchanged attribute hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lb_listener.listener will be updated in-place
  ~ resource "aws_lb_listener" "listener" {
        id                                                                  = "arn:aws:elasticloadbalancing:ap-south-1:522814736852:listener/app/weather-forecast-prod-alb/688e68496c5f6fa1/abcbc402add8cd32"
        tags                                                                = {}
        # (17 unchanged attributes hidden)

      ~ default_action {
          ~ target_group_arn = "arn:aws:elasticloadbalancing:ap-south-1:522814736852:targetgroup/weather-forecast-prod-tg/853fb385610b20ec" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # aws_lb_target_group.target_group must be replaced
-/+ resource "aws_lb_target_group" "target_group" {
      ~ arn                                = "arn:aws:elasticloadbalancing:ap-south-1:522814736852:targetgroup/weather-forecast-prod-tg/853fb385610b20ec" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/weather-forecast-prod-tg/853fb385610b20ec" -> (known after apply)
      + connection_termination             = (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:ap-south-1:522814736852:targetgroup/weather-forecast-prod-tg/853fb385610b20ec" -> (known after apply)
      ~ ip_address_type                    = "ipv4" -> (known after apply)
      ~ load_balancer_arns                 = [
          - "arn:aws:elasticloadbalancing:ap-south-1:522814736852:loadbalancer/app/weather-forecast-prod-alb/688e68496c5f6fa1",
        ] -> (known after apply)
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
      ~ load_balancing_anomaly_mitigation  = "off" -> (known after apply)
      ~ load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> (known after apply)
        name                               = "weather-forecast-prod-tg"
      + name_prefix                        = (known after apply)
      ~ port                               = 4173 -> 80 # forces replacement
      + preserve_client_ip                 = (known after apply)
      ~ protocol_version                   = "HTTP1" -> (known after apply)
        tags                               = {
            "Environment" = "prod"
            "Name"        = "weather-forecast-lb-tg"
        }
        # (8 unchanged attributes hidden)

      ~ stickiness (known after apply)
      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
            # (1 unchanged attribute hidden)
        }

      ~ target_failover (known after apply)
      - target_failover {}

      ~ target_group_health (known after apply)
      - target_group_health {
          - dns_failover {
              - minimum_healthy_targets_count      = "1" -> null
              - minimum_healthy_targets_percentage = "off" -> null
            }
          - unhealthy_state_routing {
              - minimum_healthy_targets_count      = 1 -> null
              - minimum_healthy_targets_percentage = "off" -> null
            }
        }

      ~ target_health_state (known after apply)
      - target_health_state {}

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 4 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @ravisrma, Action: `pull_request`*